In [ ]:
import pandas as pd

In [ ]:

housing = pd.concat([pd.read_csv('/content/sample_data/california_housing_train.csv'),pd.read_csv('/content/sample_data/california_housing_test.csv')])

In [ ]:
housing.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [ ]:
housing.describe()

          longitude      latitude  ...  median_income  median_house_value
count  20000.000000  20000.000000  ...   20000.000000        20000.000000
mean    -119.566172     35.626750  ...       3.872132       207082.716750
std        2.003609      2.136141  ...       1.900356       115557.055856
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.562500       119800.000000
50%     -118.490000     34.250000  ...       3.536000       179800.000000
75%     -118.000000     37.710000  ...       4.745325       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

In [ ]:
housing.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 20000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20000 non-null  float64
 1   latitude            20000 non-null  float64
 2   housing_median_age  20000 non-null  float64
 3   total_rooms         20000 non-null  float64
 4   total_bedrooms      20000 non-null  float64
 5   population          20000 non-null  float64
 6   households          20000 non-null  float64
 7   median_income       20000 non-null  float64
 8   median_house_value  20000 non-null  float64
dtypes: float64(9)
memory usage: 1.5 MB

In [ ]:
def to_classes(x):
  if x < 100000:
    return '0-100'
  elif x >= 100000 and x < 200000:
    return '100-200'
  elif x >= 200000 and x < 300000:
    return '200-300'
  elif x >= 300000 and x < 400000:
    return '300-400'
  elif x >= 400000 and x < 500002:
    return '400-500'

In [ ]:
housing['price_category'] = housing['median_house_value'].apply(to_classes)

In [ ]:
housing.drop(columns=['median_house_value'],axis=1,inplace=True)

In [ ]:
housing.head()

   longitude  latitude  ...  median_income  price_category
0    -114.31     34.19  ...         1.4936           0-100
1    -114.47     34.40  ...         1.8200           0-100
2    -114.56     33.69  ...         1.6509           0-100
3    -114.57     33.64  ...         3.1917           0-100
4    -114.57     33.57  ...         1.9250           0-100

[5 rows x 9 columns]

In [ ]:
housing['price_category'].value_counts()

100-200    8029
200-300    4726
0-100      3481
300-400    2038
400-500    1726
Name: price_category, dtype: int64

In [ ]:
housing_one_hot = housing.copy()
housing_one_hot = pd.get_dummies(housing_one_hot, columns=['price_category'], prefix = ['category'])

In [ ]:
housing_one_hot.head()

   longitude  latitude  ...  category_300-400  category_400-500
0    -114.31     34.19  ...                 0                 0
1    -114.47     34.40  ...                 0                 0
2    -114.56     33.69  ...                 0                 0
3    -114.57     33.64  ...                 0                 0
4    -114.57     33.57  ...                 0                 0

[5 rows x 13 columns]

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [ ]:
X = housing_one_hot[['longitude', 'latitude',	'housing_median_age',	'total_rooms','total_bedrooms','median_income',	'households',	'median_income']]
Y = housing_one_hot[['category_0-100',	'category_100-200',	'category_200-300',	'category_300-400',	'category_400-500']]

In [ ]:
X.head()

   longitude  latitude  ...  households  median_income
0    -114.31     34.19  ...       472.0         1.4936
1    -114.47     34.40  ...       463.0         1.8200
2    -114.56     33.69  ...       117.0         1.6509
3    -114.57     33.64  ...       226.0         3.1917
4    -114.57     33.57  ...       262.0         1.9250

[5 rows x 8 columns]

In [ ]:
Y.head()

   category_0-100  category_100-200  ...  category_300-400  category_400-500
0               1                 0  ...                 0                 0
1               1                 0  ...                 0                 0
2               1                 0  ...                 0                 0
3               1                 0  ...                 0                 0
4               1                 0  ...                 0                 0

[5 rows x 5 columns]

In [ ]:
from sklearn.preprocessing import MinMaxScaler
minmax = MinMaxScaler()
X = pd.DataFrame(minmax.fit_transform(X))
X.head()

          0         1         2  ...         5         6         7
0  1.000000  0.175345  0.274510  ...  0.068530  0.077454  0.068530
1  0.984064  0.197662  0.352941  ...  0.091040  0.075974  0.091040
2  0.975100  0.122210  0.313725  ...  0.079378  0.019076  0.079378
3  0.974104  0.116897  0.254902  ...  0.185639  0.037000  0.185639
4  0.974104  0.109458  0.372549  ...  0.098281  0.042921  0.098281

[5 rows x 8 columns]

In [ ]:
X.describe()

                  0             1  ...             6             7
count  20000.000000  20000.000000  ...  20000.000000  20000.000000
mean       0.476477      0.328029  ...      0.081981      0.232565
std        0.199563      0.227008  ...      0.062774      0.131057
min        0.000000      0.000000  ...      0.000000      0.000000
25%        0.254980      0.147715  ...      0.045881      0.142246
50%        0.583665      0.181722  ...      0.067094      0.209383
75%        0.632470      0.549416  ...      0.099161      0.292784
max        1.000000      1.000000  ...      1.000000      1.000000

[8 rows x 8 columns]

In [ ]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       20000 non-null  float64
 1   1       20000 non-null  float64
 2   2       20000 non-null  float64
 3   3       20000 non-null  float64
 4   4       20000 non-null  float64
 5   5       20000 non-null  float64
 6   6       20000 non-null  float64
 7   7       20000 non-null  float64
dtypes: float64(8)
memory usage: 1.2 MB

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size = 0.25, random_state = 0)

In [ ]:
from sklearn.tree import DecisionTreeClassifier 
classifier =DecisionTreeClassifier( criterion ='entropy', random_state=101)
classifier.fit(X_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=101, splitter='best')

In [ ]:
y_pred = classifier.predict(X_test)

In [ ]:
from sklearn.metrics import accuracy_score
score = accuracy_score(y_test,y_pred)
round(score,2)*100

64.0